{
   "appName": {
      "message": "Notebook LM"
   },
   "displayErrorDescription": {
      "message": "Sorry, something went wrong while loading the page."
   },
   "displayErrorDetailsInfo": {
      "message": "Error details:"
   },
   "displayErrorInfo": {
      "message": "Error occur"
   },
   "displayErrorReset": {
      "message": "Run Again"
   },
   "displayErrorUnknownErrorInfo": {
      "message": "Unknown error"
   },
   "shortDesc": {
      "message": "Χρησιμοποιήστε το Notebook LM για να δημιουργήσετε εύκολα ένα νέο έργο, να προσθέσετε πηγές στο τρέχον έργο!"
   },
   "storeDesc": {
      "message": "📒 Η επέκταση πλευρικής γραμμής Notebook LM για Chrome είναι ένα ισχυρό εργαλείο σχεδιασμένο για να διευκολύνει τη λήψη σημειώσεων και την έρευνα. Με λειτουργίες που τροφοδοτούνται από τεχνητή νοημοσύνη, επιτρέπει στους χρήστες να δημιουργούν και να διαχειρίζονται εύκολα δομημένα άρθρα. Είτε συλλέγετε έγγραφα, δημιουργείτε πληροφορίες ή μετατρέπετε κείμενο σε ήχο, το NotebookLM καθιστά την εις βάθος έρευνα απρόσκοπτη και αποτελεσματική. Αυτή η επέκταση σάς επιτρέπει να δημιουργείτε εύκολα έγγραφα στο NotebookLM και να προσθέτετε εύκολα διάφορα άρθρα σε υπάρχοντα έγγραφα.\n\n🛠️ Οδηγός γρήγορης εκκίνησης:\n1. Εγκαταστήστε την επέκταση κάνοντας κλικ στο 'Προσθήκη στο Chrome' από το Google Chrome Store\n2. Κάντε κλικ στο εικονίδιο στην επάνω δεξιά γωνία της καρτέλας του προγράμματος περιήγησης.\n3. Ξεκινήστε να δημιουργείτε ή να προσθέτετε πηγές στα έργα σας με ευκολία!\n\nΓιατί να επιλέξετε αυτήν την επέκταση;\n1️⃣ Δημιουργήστε στιγμιαία μια πλευρική γραμμή notebook lm με ένα μόνο κλικ\n2️⃣ Προσθέστε εύκολα πηγές σε υπάρχοντα έργα\n3️⃣ Βελτιώστε την εμπειρία έρευνάς σας με βοήθεια που τροφοδοτείται από τεχνητή νοημοσύνη\n4️⃣ Ενσωματώνεται απρόσκοπτα με την Google για μια πιο ομαλή ροή εργασίας\n5️⃣ Βελτιώστε την παραγωγικότητα και την οργάνωση με τις λειτουργίες της πλευρικής γραμμής notebook lm\n6️⃣ Αποκτήστε γρήγορη πρόσβαση, επεξεργαστείτε και διαχειριστείτε τις σημειώσεις σας οποιαδήποτε στιγμή\n7️⃣ Βελτιστοποιήστε τη συλλογή πληροφοριών με την πλευρική γραμμή notebook lm\n8️⃣ Μεγιστοποιήστε την αποδοτικότητα χρησιμοποιώντας την επέκταση\n9️⃣ Βρείτε την τέλεια εναλλακτική πλευρική γραμμή notebook lm για τη ροή εργασίας σας\n🔮 Ανακαλύψτε έναν πιο έξυπνο τρόπο οργάνωσης με το Notebook LM!\n\n📚 Κάντε μια ηχητική βαθιά κατάδυση\n👍 Συγκεντρώστε εύκολα έγγραφα για βαθιά έρευνα\n💡 Δημιουργήστε γνώσεις χρησιμοποιώντας τις δυνατότητες του notebook lm\n🤝 Ανακαλύψτε πώς να το χρησιμοποιείτε αποτελεσματικά για διάφορους σκοπούς\n\n📱 Λειτουργία Podcast\n🔄 Μεταγράψτε, συνοψίστε και αναλύστε podcasts\n📈 Αποκτήστε δομημένες γνώσεις από ηχητικές συζητήσεις\n🎤 Ενισχύστε τη μάθηση με τη γεννήτρια AI podcast\n\n💡 Τι είναι αυτή η επέκταση;\n🦊 Αυτή η επέκταση Notebook LM sidebar Chrome είναι ένα προηγμένο εργαλείο σχεδιασμένο να βοηθά τους χρήστες να οργανώνουν, να δημιουργούν εύκολα νέα έργα και να προσθέτουν πηγές απρόσκοπτα, καθώς και να δημιουργούν γνώσεις με ευκολία. Είτε εργάζεστε σε βαθιά έρευνα είτε χρειάζεστε έναν βοηθό που τροφοδοτείται από τεχνητή νοημοσύνη, είναι η απόλυτη λύση.\n\n🛠️ Πώς να το χρησιμοποιήσετε;\n1️⃣ Εγκαταστήστε την επέκταση από το Google Chrome Store\n2️⃣ Κάντε κλικ στο εικονίδιο αυτής της επέκτασης στη δεξιά γωνία της καρτέλας του προγράμματος περιήγησης\n3️⃣ Ξεκινήστε να προσθέτετε έγγραφα ή να δημιουργείτε νέο σημειωματάριο αμέσως\n\n🔍 Εξερευνήστε εναλλακτικές\n🚀 Ψάχνετε για εναλλακτική του Notebook LM; Εξερευνήστε παρόμοιες λύσεις AI Notebook με συγκρίσιμες λειτουργίες, διασφαλίζοντας ευελιξία και αποτελεσματικότητα.\n\n💻 Ενισχύστε την έρευνά σας με το Google LM\n📡 Χρησιμοποιήστε εργαλεία τεχνητής νοημοσύνης για να δημιουργήσετε περιλήψεις\n✨ Οργανώστε τις σημειώσεις σας με το Notebook Google KLM\n📃 Συνεργαστείτε αποτελεσματικά χρησιμοποιώντας το LM Notes\n\n🌟 AI notebook lm για πιο έξυπνη έρευνα\n🏷️ Βελτιώστε την παραγωγικότητα με τα εργαλεία NotebookLM Podcast\n🖋️ Αξιοποιήστε το notebook lm για δομημένες πληροφορίες\n⚛️ Χρησιμοποιήστε το NotebookLM για ακαδημαϊκή και επαγγελματική εργασία\n\n🎧 Γεννήτρια AI Podcast & Μάθηση\n🗣️ Μετατρέψτε συζητήσεις σε δομημένες σημειώσεις\n💬 Μάθετε πώς να δημιουργείτε podcasts τεχνητής νοημοσύνης με το google lm\n🔑 Αποκτήστε γρήγορη πρόσβαση σε βασικές πληροφορίες χρησιμοποιώντας τις λειτουργίες του google lm\n\n💡 Γεννήτρια Google AI Podcast\n💡 Αυτοματοποιήστε τη μεταγραφή και τη σύνοψη podcast\n⏳ Εξοικονομήστε χρόνο με κείμενο που δημιουργείται από τεχνητή νοημοσύνη από συζητήσεις\n📀 Ενισχύστε τη μάθηση και την έρευνα με γνώσεις που τροφοδοτούνται από τεχνητή νοημοσύνη\n\n🧠 Επανάσταση AI\n🚀 Το Google ai notebook μεταμορφώνει τον τρόπο με τον οποίο αλληλεπιδράτε με πληροφορίες στο διαδίκτυο. Αυτή η λύση NoteboolLLM παρέχει έξυπνη βοήθεια για:\n➤ Σύνοψη πολύπλοκων θεμάτων\n➤ Αναγνώριση βασικών εννοιών\n➤ Δημιουργία γνώσεων από πολλαπλές πηγές\n➤ Δημιουργία συνδέσεων μεταξύ διαφορετικών κομματιών πληροφοριών\n➤ Παραγωγή ολοκληρωμένων αναφορών και αναλύσεων\n\n💪 Ενισχύστε την παραγωγικότητα με την Google AI\n📅 Παραμείνετε οργανωμένοι με τα διαισθητικά χαρακτηριστικά του NotebookLM\n💰 Αποκτήστε άμεσες πληροφορίες από το NotebookLM\n🎚️ Απλοποιήστε την έρευνα με προηγμένο notebook ai\n\n🔄 Διαχείριση πηγών απλοποιημένη\nΑναρωτιέστε πόσες πηγές μπορεί να χειριστεί ή πώς να κατεβάσετε πηγές από την επέκταση;\nΗ επέκταση προσφέρει ισχυρή διαχείριση εγγράφων:\n➤ Προσθέστε απεριόριστα έγγραφα στα έργα σας\n➤ Οργανώστε πηγές κατά θέμα, έργο ή προσαρμοσμένες κατηγορίες\n➤ Κατεβάστε και εξάγετε εύκολα υλικό πηγών\n➤ Παρακολουθήστε αυτόματα τις προελεύσεις των εγγράφων\n➤ Αναφέρετε σωστά τις πηγές με ενσωματωμένα εργαλεία παραπομπών\n\n💰 Μεγάλη αξία σε οποιοδήποτε επίπεδο\nΑνησυχείτε για το κόστος; Να είστε βέβαιοι ότι η επέκταση προσφέρει τεράστια αξία:\n➤ Δωρεάν επίπεδο με βασικές λειτουργίες\n➤ Προσιτές επιλογές premium για προχωρημένους χρήστες\n➤ Επιχειρηματικές λύσεις για ομάδες και οργανισμούς\n➤ Ειδικές τιμές για εκπαιδευτικά ιδρύματα\n➤ Ευέλικτες επιλογές πληρωμής που ταιριάζουν σε οποιονδήποτε προϋπολογισμό\n\n📱 Συμβατότητα μεταξύ πλατφορμών\nΗ εφαρμογή Google AI λειτουργεί σε όλες τις συσκευές σας:\n➤ Πρόγραμμα περιήγησης Chrome σε επιτραπέζιους υπολογιστές και φορητούς υπολογιστές\n➤ Προγράμματα περιήγησης για κινητά για πρόσβαση εν κινήσει\n➤ Συμβατότητα με tablet για ευέλικτη χρήση\n➤ Συνεπής εμπειρία σε όλες τις πλατφόρμες\n➤ Αυτόματος συγχρονισμός μεταξύ συσκευών\n\n❓ Συχνές ερωτήσεις\n\n🌐 Μπορώ να το χρησιμοποιήσω εκτός σύνδεσης;\n📢 Προς το παρόν, απαιτεί σύνδεση στο Internet. Ωστόσο, οι χρήστες μπορούν να αποθηκεύσουν περιεχόμενο για πρόσβαση εκτός σύνδεσης μέσα στο πρόγραμμα περιήγησής τους.\n\n📝 Πόσες πηγές notebooklm;\n✈️ Το Google lm επιτρέπει στους χρήστες να προσθέτουν πολλαπλές πηγές χωρίς περιορισμούς\n⛄ Ιδανικό για βαθιά έρευνα, δημιουργία περιεχομένου και οργάνωση γνώσεων\n\n💾 Πώς να κατεβάσετε πηγές από το notebook lm;\n🌊 Αποκτήστε πρόσβαση στις πηγές σας στον ιστότοπο του google lm\n🦊 Χρησιμοποιήστε την ενσωματωμένη λειτουργία εξαγωγής για να κατεβάσετε πηγές\n🐶 Οργανώστε και αποθηκεύστε τα δεδομένα σας αποτελεσματικά\n\n📌 Μπορεί το ai notebook να δημιουργήσει περιεχόμενο με βάση τις πηγές μου;\n💡 Ναι! Η τεχνητή νοημοσύνη μπορεί να δημιουργήσει περιλήψεις, αναφορές, ακόμη και δημιουργικό περιεχόμενο με βάση τις συλλεγμένες πηγές σας.\n\n📌 Μπορώ να χρησιμοποιήσω το Notebook LM για ακαδημαϊκή έρευνα;\n💡 Απολύτως! Η επέκταση είναι τέλεια για ακαδημαϊκή έρευνα με σωστές δυνατότητες παραπομπών και παρακολούθησης πηγών.\n\n📌 Υποστηρίζει το Notebook LM πολλαπλές γλώσσες;\n💡 Ναι, η επέκταση υποστηρίζει δεκάδες γλώσσες για πραγματικά παγκόσμιες δυνατότητες έρευνας.\n\n📌 Είναι τα δεδομένα μου ασφαλή με το NotebookML;\n💡 Ναι! Τα δεδομένα σας προστατεύονται με κρυπτογράφηση βιομηχανικού προτύπου και τις ισχυρές πρακτικές ασφαλείας της Google.\n\n🚀 Εγκαταστήστε την επέκταση Chrome τώρα και ανεβάστε την εμπειρία έρευνάς σας στο επόμενο επίπεδο με το Notebook LM!"
   }
}
