{
   "appName": {
      "message": "Notebook LM"
   },
   "displayErrorDescription": {
      "message": "Sorry, something went wrong while loading the page."
   },
   "displayErrorDetailsInfo": {
      "message": "Error details:"
   },
   "displayErrorInfo": {
      "message": "Error occur"
   },
   "displayErrorReset": {
      "message": "Run Again"
   },
   "displayErrorUnknownErrorInfo": {
      "message": "Unknown error"
   },
   "shortDesc": {
      "message": "Notebook LM を使用して簡単にウェブページをインポートし、ワンクリックで NotebookLM に YouTube を追加しましょう！"
   },
   "storeDesc": {
      "message": "📒 Notebook LMサイドバーChrome拡張機能は、メモ取りと研究を効率化するために設計された強力なツールです。AI駆動の機能により、ユーザーは構造化された記事を簡単に作成・管理できます。文書の収集、インサイトの生成、テキストから音声への変換など、NotebookLMは深い研究をスムーズで効率的なものにします。この拡張機能を使えば、NotebookLMで簡単に文書を作成し、既存の文書にさまざまな記事を簡単に追加できます。\n\n🛠️ クイックスタートガイド：\n1. Google Chrome ストアから「Chromeに追加」をクリックして拡張機能をインストールします\n2. ブラウザタブの右上隅にあるアイコンをクリックします。\n3. プロジェクトにソースを簡単に作成または追加しましょう！\n\nなぜこの拡張機能を選ぶのか？\n1️⃣ ワンクリックですぐにnotebook lmサイドバーを作成\n2️⃣ 既存のプロジェクトに簡単にソースを追加\n3️⃣ 人工知能駆動のアシスタンスであなたの調査体験を向上\n4️⃣ よりスムーズなワークフローのためにGoogleとシームレスに統合\n5️⃣ notebook lmサイドバー機能で生産性と組織化を向上\n6️⃣ いつでも素早くメモにアクセス、編集、管理\n7️⃣ notebook lmサイドバーで情報収集を最適化\n8️⃣ 拡張機能の使用で効率を最大化\n9️⃣ あなたのワークフローにぴったりのnotebook lmサイドバーの代替品を見つける\n🔮 Notebook LMでよりスマートな整理方法を発見しましょう！\n\n📚 オーディオディープダイブを行う\n👍 深い研究のために簡単に文書をコンパイル\n💡 notebook lmの機能を使ってインサイトを生成\n🤝 様々な目的に効果的に使用する方法を発見\n\n📱 ポッドキャスト機能\n🔄 ポッドキャストの文字起こし、要約、分析\n📈 オーディオディスカッションから構造化されたインサイトを取得\n🎤 AIポッドキャストジェネレーターで学習を強化\n\n💡 この拡張機能とは？\n🦊 このNotebook LMサイドバーChrome拡張機能は、ユーザーが整理し、新しいプロジェクトを簡単に作成し、ソースをシームレスに追加し、インサイトを簡単に生成するのを助けるために設計された高度なパワードツールです。深い研究に取り組んでいるか、AI駆動のアシスタントが必要かに関わらず、これは究極のソリューションです。\n\n🛠️ 使用方法は？\n1️⃣ Google Chrome ストアから拡張機能をインストール\n2️⃣ ブラウザタブの右隅にあるこの拡張機能のアイコンをクリック\n3️⃣ 即座に文書を追加するか新しいノートブックを作成開始\n\n🔍 代替品を探る\n🚀 Notebook LMの代替品をお探しですか？柔軟性と効率性を確保する比較可能な機能を持つ同様のAI Notebookソリューションを探索してください。\n\n💻 Google LMであなたの研究を強化\n📡 要約を生成するためにAI駆動ツールを使用\n✨ Notebook Google KLMであなたのメモを整理\n📃 LM Notesを使用して効果的に協力\n\n🌟 より賢い研究のためのAI notebook lm\n🏷️ NotebookLMポッドキャストツールで生産性を向上\n🖋️ 構造化されたインサイトのためにnotebook lmを活用\n⚛️ 学術的および専門的な仕事のためにNotebookLMを使用\n\n🎧 AIポッドキャストジェネレーターと学習\n🗣️ ディスカッションを構造化されたメモに変換\n💬 google lmで人工知能ポッドキャストを生成する方法を学ぶ\n🔑 google lm機能を使用して主要なインサイトに素早くアクセス\n\n💡 Google AIポッドキャストジェネレーター\n💡 ポッドキャストの文字起こしと要約を自動化\n⏳ ディスカッションからAI生成テキストで時間を節約\n📀 AI駆動のインサイトで学習と研究を強化\n\n🧠 AI革命\n🚀 Google ai notebookはオンラインの情報とのやり取り方法を変革します。このNoteboolLLMソリューションは以下のためのインテリジェントなアシスタンスを提供します：\n➤ 複雑なトピックの要約\n➤ 主要な概念の特定\n➤ 複数のソースからのインサイト生成\n➤ 異なる情報のピース間の接続作成\n➤ 包括的なレポートと分析の作成\n\n💪 Google AIで生産性を向上\n📅 NotebookLMの直感的な機能で整理された状態を維持\n💰 NotebookLMからの即時インサイトを取得\n🎚️ 高度なnotebook aiで研究を簡素化\n\n🔄 ソース管理がシンプルに\n拡張機能が処理できるソースの数や、拡張機能からソースをダウンロードする方法について疑問がありますか？\n拡張機能は堅牢な文書管理を提供します：\n➤ プロジェクトに無制限の文書を追加\n➤ トピック、プロジェクト、またはカスタムカテゴリでソースを整理\n➤ ソース素材を簡単にダウンロードおよびエクスポート\n➤ 文書の起源を自動的に追跡\n➤ 内蔵の引用ツールでソースを適切に引用\n\n💰 どのレベルでも素晴らしい価値\n費用が心配ですか？拡張機能は莫大な価値を提供することをご安心ください：\n➤ 必須機能を備えた無料レベル\n➤ パワーユーザー向けの手頃なプレミアムオプション\n➤ チームや組織向けのエンタープライズソリューション\n➤ 教育機関向けの特別価格設定\n➤ どんな予算にも合う柔軟な支払いオプション\n\n📱 クロスプラットフォーム互換性\nGoogle AIアプリはあなたのすべてのデバイスで動作します：\n➤ デスクトップとラップトップ上のChromeブラウザ\n➤ 移動中のアクセス用モバイルブラウザ\n➤ 柔軟な使用のためのタブレット互換性\n➤ すべてのプラットフォームで一貫したエクスペリエンス\n➤ デバイス間の自動同期\n\n❓ よくある質問\n\n🌐 オフラインで使用できますか？\n📢 現在、インターネット接続が必要です。しかし、ユーザーはブラウザ内でオフラインアクセス用にコンテンツを保存できます。\n\n📝 notebooklmのソースはいくつですか？\n✈️ Google lmはユーザーが制限なく複数のソースを追加できるようにします\n⛄ 深い研究、コンテンツ作成、知識整理に最適\n\n💾 notebook lmからソースをダウンロードする方法は？\n🌊 google lmサイトであなたのソースにアクセス\n🦊 内蔵のエクスポート機能を使用してソースをダウンロード\n🐶 データを効率的に整理して保存\n\n📌 ai notebookは私のソースに基づいてコンテンツを生成できますか？\n💡 はい！AIはあなたの収集したソースに基づいて要約、レポート、さらには創造的なコンテンツを作成できます。\n\n📌 Notebook LMを学術研究に使用できますか？\n💡 もちろんです！拡張機能は適切な引用とソース追跡機能を備えた学術研究に最適です。\n\n📌 Notebook LMは複数の言語をサポートしていますか？\n💡 はい、拡張機能は真にグローバルな研究能力のために何十もの言語をサポートしています。\n\n📌 NotebookMLで私のデータは安全ですか？\n💡 はい！あなたのデータは業界標準の暗号化とGoogleの堅牢なセキュリティプラクティスで保護されています。\n\n🚀 今すぐChrome拡張機能をインストールして、Notebook LMであなたの研究体験を次のレベルに引き上げましょう！"
   }
}
