{
   "appName": {
      "message": "Notebook LM"
   },
   "displayErrorDescription": {
      "message": "Sorry, something went wrong while loading the page."
   },
   "displayErrorDetailsInfo": {
      "message": "Error details:"
   },
   "displayErrorInfo": {
      "message": "Error occur"
   },
   "displayErrorReset": {
      "message": "Run Again"
   },
   "displayErrorUnknownErrorInfo": {
      "message": "Unknown error"
   },
   "shortDesc": {
      "message": "השתמשו ב- Notebook LM כדי לייבא דפי אינטרנט בקלות ולהוסיף YouTube ל-NotebookLM בלחיצה אחת!"
   },
   "storeDesc": {
      "message": "📒 הרחבת סרגל הצד Notebook LM לכרום היא כלי עוצמתי שתוכנן לפשט רישום הערות ומחקר. עם תכונות מונעות בינה מלאכותית, היא מאפשרת למשתמשים ליצור ולנהל בקלות מאמרים מובנים. בין אם אתם אוספים מסמכים, מייצרים תובנות, או ממירים טקסט לאודיו, NotebookLM הופך מחקר מעמיק לחלק ויעיל. הרחבה זו מאפשרת לכם ליצור מסמכים ב-NotebookLM ללא מאמץ ולהוסיף בקלות מאמרים שונים למסמכים קיימים.\n\n🛠️ מדריך התחלה מהיר:\n1. התקינו את ההרחבה על ידי לחיצה על 'הוסף לכרום' מחנות Google Chrome\n2. לחצו על הסמל בפינה הימנית העליונה של כרטיסיית הדפדפן.\n3. התחילו ליצור או להוסיף מקורות לפרויקטים שלכם בקלות!\n\nלמה לבחור בהרחבה זו?\n1️⃣ צרו באופן מיידי סרגל צד notebook lm בלחיצה אחת בלבד\n2️⃣ הוסיפו בקלות מקורות לפרויקטים קיימים\n3️⃣ שפרו את חווית החקירה שלכם עם סיוע מונע בינה מלאכותית\n4️⃣ אינטגרציה חלקה עם גוגל לזרימת עבודה חלקה יותר\n5️⃣ שפרו את הפרודוקטיביות והארגון עם תכונות סרגל הצד notebook lm\n6️⃣ גשו במהירות, ערכו ונהלו את ההערות שלכם בכל עת\n7️⃣ אופטימיזציה של איסוף מידע עם סרגל הצד notebook lm\n8️⃣ מקסמו את היעילות באמצעות ההרחבה\n9️⃣ מצאו את האלטרנטיבה המושלמת לסרגל הצד notebook lm עבור זרימת העבודה שלכם\n🔮 גלו דרך חכמה יותר להתארגן עם Notebook LM!\n\n📚 צללו לעומק האודיו\n👍 הרכיבו בקלות מסמכים למחקר מעמיק\n💡 יצרו תובנות באמצעות יכולות notebook lm\n🤝 גלו כיצד להשתמש ביעילות למטרות שונות\n\n📱 תכונת פודקאסט\n🔄 תמללו, סכמו ונתחו פודקאסטים\n📈 קבלו תובנות מובנות משיחות אודיו\n🎤 שפרו את הלמידה עם מחולל הפודקאסט של בינה מלאכותית\n\n💡 מהי הרחבה זו?\n🦊 הרחבת Notebook LM sidebar Chrome היא כלי מתקדם שתוכנן לעזור למשתמשים לארגן, ליצור בקלות פרויקטים חדשים ולהוסיף מקורות בצורה חלקה וגם לייצר תובנות בקלות. בין אם אתם עובדים על מחקר מעמיק או זקוקים לעוזר מונע בינה מלאכותית, זהו הפתרון האולטימטיבי.\n\n🛠️ איך להשתמש בה?\n1️⃣ התקינו את ההרחבה מחנות Google Chrome\n2️⃣ לחצו על הסמל של הרחבה זו בפינה הימנית של כרטיסיית הדפדפן\n3️⃣ התחילו להוסיף מסמכים או ליצור מחברת חדשה באופן מיידי\n\n🔍 חקרו אלטרנטיבות\n🚀 מחפשים אלטרנטיבה ל-Notebook LM? חקרו פתרונות AI Notebook דומים עם תכונות דומות, המבטיחים גמישות ויעילות.\n\n💻 שפרו את המחקר שלכם עם Google LM\n📡 השתמשו בכלים מונעי בינה מלאכותית לייצור סיכומים\n✨ ארגנו את ההערות שלכם עם Notebook Google KLM\n📃 שתפו פעולה ביעילות באמצעות LM Notes\n\n🌟 AI notebook lm למחקר חכם יותר\n🏷️ שפרו את הפרודוקטיביות עם כלי NotebookLM Podcast\n🖋️ נצלו את notebook lm לתובנות מובנות\n⚛️ השתמשו ב-NotebookLM לעבודה אקדמית ומקצועית\n\n🎧 מחולל פודקאסט בינה מלאכותית ולמידה\n🗣️ המירו דיונים להערות מובנות\n💬 למדו איך לייצר פודקאסטים של בינה מלאכותית עם google lm\n🔑 גשו במהירות לתובנות מפתח באמצעות תכונות google lm\n\n💡 מחולל פודקאסט Google AI\n💡 אוטומציה של תמלול וסיכום פודקאסט\n⏳ חסכו זמן עם טקסט שנוצר על ידי בינה מלאכותית מדיונים\n📀 שפרו למידה ומחקר עם תובנות מונעות בינה מלאכותית\n\n🧠 מהפכת הבינה המלאכותית\n🚀 Google ai notebook משנה את האופן שבו אתם מתקשרים עם מידע באינטרנט. פתרון NoteboolLLM זה מספק סיוע חכם עבור:\n➤ סיכום נושאים מורכבים\n➤ זיהוי מושגי מפתח\n➤ יצירת תובנות ממקורות מרובים\n➤ יצירת קשרים בין חלקי מידע שונים\n➤ הפקת דוחות וניתוחים מקיפים\n\n💪 הגבירו את הפרודוקטיביות עם Google AI\n📅 הישארו מאורגנים עם תכונות אינטואיטיביות של NotebookLM\n💰 קבלו תובנות מיידיות מ-NotebookLM\n🎚️ פשטו את המחקר עם notebook ai מתקדם\n\n🔄 ניהול מקורות שנעשה פשוט\nתוהים כמה מקורות יכול לטפל או איך להוריד מקורות מההרחבה?\nההרחבה מציעה ניהול מסמכים חזק:\n➤ הוסיפו מסמכים בלתי מוגבלים לפרויקטים שלכם\n➤ ארגנו מקורות לפי נושא, פרויקט או קטגוריות מותאמות אישית\n➤ הורידו וייצאו חומרי מקור בקלות\n➤ עקבו אוטומטית אחר מקור המסמכים\n➤ ציטטו מקורות כהלכה עם כלי ציטוט מובנים\n\n💰 ערך נהדר בכל רמה\nמודאגים מהעלות? היו בטוחים שההרחבה מציעה ערך עצום:\n➤ רמה חינמית עם תכונות חיוניות\n➤ אפשרויות פרימיום במחיר סביר למשתמשים מתקדמים\n➤ פתרונות ארגוניים לצוותים וארגונים\n➤ תמחור מיוחד למוסדות חינוך\n➤ אפשרויות תשלום גמישות המתאימות לכל תקציב\n\n📱 תאימות בין פלטפורמות\nאפליקציית Google AI עובדת בכל המכשירים שלכם:\n➤ דפדפן כרום על מחשבי שולחן וניידים\n➤ דפדפנים ניידים לגישה בדרכים\n➤ תאימות לטאבלט לשימוש גמיש\n➤ חוויה עקבית בכל הפלטפורמות\n➤ סנכרון אוטומטי בין מכשירים\n\n❓ שאלות נפוצות\n\n🌐 האם אני יכול להשתמש במצב לא מקוון?\n📢 כעת, נדרש חיבור לאינטרנט. עם זאת, משתמשים יכולים לשמור תוכן לגישה במצב לא מקוון בתוך הדפדפן שלהם.\n\n📝 כמה מקורות notebooklm?\n✈️ Google lm מאפשר למשתמשים להוסיף מקורות מרובים ללא הגבלות\n⛄ אידיאלי למחקר מעמיק, יצירת תוכן וארגון ידע\n\n💾 איך להוריד מקורות מ-notebook lm?\n🌊 גשו למקורות שלכם באתר google lm\n🦊 השתמשו בפונקציית הייצוא המובנית כדי להוריד מקורות\n🐶 ארגנו ואחסנו את הנתונים שלכם ביעילות\n\n📌 האם ai notebook יכול לייצר תוכן על בסיס המקורות שלי?\n💡 כן! הבינה המלאכותית יכולה ליצור סיכומים, דוחות ואפילו תוכן יצירתי על בסיס המקורות שאספתם.\n\n📌 האם אני יכול להשתמש ב-Notebook LM למחקר אקדמי?\n💡 בהחלט! ההרחבה מושלמת למחקר אקדמי עם יכולות ציטוט ומעקב מקורות נאותות.\n\n📌 האם Notebook LM תומך במספר שפות?\n💡 כן, ההרחבה תומכת בעשרות שפות ליכולות מחקר גלובליות באמת.\n\n📌 האם הנתונים שלי מאובטחים עם NotebookML?\n💡 כן! הנתונים שלכם מוגנים עם הצפנה בתקן תעשייתי והפרקטיקות האבטחה החזקות של גוגל.\n\n🚀 התקינו את הרחבת כרום עכשיו והעלו את חווית המחקר שלכם לרמה הבאה עם Notebook LM!"
   }
}
