{
   "appName": {
      "message": "Notebook LM"
   },
   "displayErrorDescription": {
      "message": "Sorry, something went wrong while loading the page."
   },
   "displayErrorDetailsInfo": {
      "message": "Error details:"
   },
   "displayErrorInfo": {
      "message": "Error occur"
   },
   "displayErrorReset": {
      "message": "Run Again"
   },
   "displayErrorUnknownErrorInfo": {
      "message": "Unknown error"
   },
   "shortDesc": {
      "message": "Используйте Notebook LM для легкого импорта веб-страниц и добавления YouTube в NotebookLM одним кликом!"
   },
   "storeDesc": {
      "message": "📒 Расширение Notebook LM сайдбар для Chrome — это мощный инструмент, разработанный для упрощения ведения заметок и исследований. С функциями на базе искусственного интеллекта оно позволяет пользователям легко создавать и управлять структурированными статьями. Собираете ли вы документы, создаете аналитические выводы или преобразуете текст в аудио, NotebookLM делает глубокие исследования плавными и эффективными. Это расширение позволяет вам без усилий создавать документы в NotebookLM и легко добавлять различные статьи в существующие документы.\n\n🛠️ Краткое руководство по началу работы:\n1. Установите расширение, нажав «Добавить в Chrome» из магазина Google Chrome\n2. Нажмите на значок в правом верхнем углу вкладки браузера.\n3. Начните создавать или добавлять источники в свои проекты без усилий!\n\nПочему стоит выбрать это расширение?\n1️⃣ Мгновенное создание боковой панели notebook lm всего одним щелчком мыши\n2️⃣ Легкое добавление источников в существующие проекты\n3️⃣ Улучшение вашего исследовательского опыта с помощью искусственного интеллекта\n4️⃣ Бесшовная интеграция с Google для более плавного рабочего процесса\n5️⃣ Повышение продуктивности и организации с функциями боковой панели notebook lm\n6️⃣ Быстрый доступ, редактирование и управление заметками в любое время\n7️⃣ Оптимизация сбора информации с боковой панелью notebook lm\n8️⃣ Максимизация эффективности при использовании расширения\n9️⃣ Поиск идеальной альтернативы боковой панели notebook lm для вашего рабочего процесса\n🔮 Откройте для себя более умный способ организации с Notebook LM!\n\n📚 Погрузитесь в аудио\n👍 Легко составляйте документы для глубоких исследований\n💡 Создавайте аналитические выводы, используя возможности notebook lm\n🤝 Узнайте, как эффективно использовать его для различных целей\n\n📱 Функция подкаста\n🔄 Транскрибирование, резюмирование и анализ подкастов\n📈 Получение структурированных выводов из аудиодискуссий\n🎤 Улучшение обучения с генератором AI-подкастов\n\n💡 Что такое это расширение?\n🦊 Это расширение боковой панели Notebook LM для Chrome — это продвинутый инструмент, разработанный, чтобы помочь пользователям организовывать, легко создавать новые проекты и без проблем добавлять источники, а также легко создавать аналитические выводы. Работаете ли вы над глубоким исследованием или нуждаетесь в AI-ассистенте, это идеальное решение.\n\n🛠️ Как его использовать?\n1️⃣ Установите расширение из магазина Google Chrome\n2️⃣ Щелкните на значок этого расширения в правом углу вкладки браузера\n3️⃣ Начните добавлять документы или создавать новую записную книжку мгновенно\n\n🔍 Изучайте альтернативы\n🚀 Ищете альтернативу Notebook LM? Изучите похожие решения AI Notebook с сопоставимыми функциями, обеспечивающими гибкость и эффективность.\n\n💻 Улучшите ваше исследование с Google LM\n📡 Используйте инструменты на базе искусственного интеллекта для создания резюме\n✨ Организуйте свои заметки с Notebook Google KLM\n📃 Эффективно сотрудничайте, используя LM Notes\n\n🌟 AI notebook lm для более умного исследования\n🏷️ Повышение продуктивности с инструментами NotebookLM Podcast\n🖋️ Воспользуйтесь преимуществами notebook lm для структурированных выводов\n⚛️ Используйте NotebookLM для академической и профессиональной работы\n\n🎧 Генератор AI-подкастов и обучение\n🗣️ Преобразуйте дискуссии в структурированные заметки\n💬 Узнайте, как создавать подкасты на основе искусственного интеллекта с google lm\n🔑 Быстро доступайте к ключевым выводам, используя функции google lm\n\n💡 Генератор подкастов Google AI\n💡 Автоматизируйте транскрипцию и резюмирование подкастов\n⏳ Экономьте время с текстом, сгенерированным искусственным интеллектом из дискуссий\n📀 Улучшайте обучение и исследования с аналитическими выводами на основе AI\n\n🧠 Революция AI\n🚀 Google ai notebook трансформирует способ вашего взаимодействия с информацией в интернете. Это решение NoteboolLLM предоставляет интеллектуальную помощь для:\n➤ Резюмирования сложных тем\n➤ Выявления ключевых концепций\n➤ Создания выводов из нескольких источников\n➤ Создания связей между различными частями информации\n➤ Составления всеобъемлющих отчетов и анализов\n\n💪 Повысьте продуктивность с Google AI\n📅 Оставайтесь организованными с интуитивными функциями NotebookLM\n💰 Получайте мгновенные аналитические выводы из NotebookLM\n🎚️ Упростите исследования с продвинутым notebook ai\n\n🔄 Управление источниками упрощено\nИнтересно, сколько источников можно обрабатывать или как загружать источники из расширения?\nРасширение предлагает надежное управление документами:\n➤ Добавляйте неограниченное количество документов в ваши проекты\n➤ Организуйте источники по теме, проекту или пользовательским категориям\n➤ Легко загружайте и экспортируйте исходные материалы\n➤ Автоматически отслеживайте происхождение документов\n➤ Правильно цитируйте источники с помощью встроенных инструментов цитирования\n\n💰 Отличная ценность на любом уровне\nБеспокоитесь о стоимости? Будьте уверены, что расширение предлагает огромную ценность:\n➤ Бесплатный уровень с основными функциями\n➤ Доступные премиум-опции для продвинутых пользователей\n➤ Корпоративные решения для команд и организаций\n➤ Специальные цены для образовательных учреждений\n➤ Гибкие варианты оплаты, подходящие для любого бюджета\n\n📱 Кросс-платформенная совместимость\nПриложение Google AI работает на всех ваших устройствах:\n➤ Браузер Chrome на настольных компьютерах и ноутбуках\n➤ Мобильные браузеры для доступа в пути\n➤ Совместимость с планшетами для гибкого использования\n➤ Последовательный опыт на всех платформах\n➤ Автоматическая синхронизация между устройствами\n\n❓ Часто задаваемые вопросы\n\n🌐 Могу ли я использовать его офлайн?\n📢 В настоящее время требуется подключение к интернету. Однако пользователи могут сохранять контент для офлайн-доступа в своем браузере.\n\n📝 Сколько источников в notebooklm?\n✈️ Google lm позволяет пользователям добавлять несколько источников без ограничений\n⛄ Идеально подходит для глубоких исследований, создания контента и организации знаний\n\n💾 Как загрузить источники из notebook lm?\n🌊 Получите доступ к своим источникам на сайте google lm\n🦊 Используйте встроенную функцию экспорта для загрузки источников\n🐶 Эффективно организуйте и храните свои данные\n\n📌 Может ли ai notebook генерировать контент на основе моих источников?\n💡 Да! ИИ может создавать резюме, отчеты и даже творческий контент на основе ваших собранных источников.\n\n📌 Могу ли я использовать Notebook LM для академических исследований?\n💡 Абсолютно! Расширение идеально подходит для академических исследований с соответствующими возможностями цитирования и отслеживания источников.\n\n📌 Поддерживает ли Notebook LM несколько языков?\n💡 Да, расширение поддерживает десятки языков для действительно глобальных исследовательских возможностей.\n\n📌 Безопасны ли мои данные с NotebookML?\n💡 Да! Ваши данные защищены шифрованием промышленного стандарта и надежными практиками безопасности Google.\n\n🚀 Установите расширение Chrome сейчас и выведите свой исследовательский опыт на новый уровень с Notebook LM!"
   }
}
