{
   "appName": {
      "message": "Notebook LM"
   },
   "displayErrorDescription": {
      "message": "Sorry, something went wrong while loading the page."
   },
   "displayErrorDetailsInfo": {
      "message": "Error details:"
   },
   "displayErrorInfo": {
      "message": "Error occur"
   },
   "displayErrorReset": {
      "message": "Run Again"
   },
   "displayErrorUnknownErrorInfo": {
      "message": "Unknown error"
   },
   "shortDesc": {
      "message": "Користите Notebook LM за лако увожење веб страница и додавање YouTube-a у NotebookLM једним кликом!"
   },
   "storeDesc": {
      "message": "📒 Notebook LM бочна трака проширење за Chrome је моћан алат дизајниран да поједностави вођење белешки и истраживање. Са функцијама које покреће вештачка интелигенција, омогућава корисницима да лако креирају и управљају структурираним чланцима. Било да прикупљате документе, генеришете увиде или претварате текст у аудио, NotebookLM чини дубинско истраживање беспрекорним и ефикасним. Ово проширење вам омогућава да без напора креирате документе у NotebookLM-у и лако додајете различите чланке у постојеће документе.\n\n🛠️ Водич за брзи почетак:\n1. Инсталирајте проширење кликом на 'Додај у Chrome' из Google Chrome продавнице\n2. Кликните на икону у горњем десном углу картице прегледача.\n3. Почните да креирате или додајете изворе у своје пројекте без напора!\n\nЗашто изабрати ово проширење?\n1️⃣ Инстантно креирајте notebook lm бочну траку само једним кликом\n2️⃣ Лако додајте изворе у постојеће пројекте\n3️⃣ Побољшајте своје искуство истраживања уз помоћ вештачке интелигенције\n4️⃣ Беспрекорно се интегришите са Google-ом за глаткији ток рада\n5️⃣ Побољшајте продуктивност и организацију са функцијама notebook lm бочне траке\n6️⃣ Брзо приступите, уређујте и управљајте својим белешкама у било ком тренутку\n7️⃣ Оптимизујте прикупљање информација помоћу notebook lm бочне траке\n8️⃣ Максимално повећајте ефикасност користећи проширење\n9️⃣ Пронађите савршену алтернативу за notebook lm бочну траку за свој ток рада\n🔮 Откријте паметнији начин организовања са Notebook LM!\n\n📚 Направите аудио дубинско истраживање\n👍 Лако компилирајте документе за дубинско истраживање\n💡 Генеришите увиде користећи могућности notebook lm-а\n🤝 Откријте како ефикасно користити за различите сврхе\n\n📱 Функција подкаста\n🔄 Транскрибујте, сумирајте и анализирајте подкасте\n📈 Добијте структуриране увиде из аудио дискусија\n🎤 Побољшајте учење са АИ генератором подкаста\n\n💡 Шта је ово проширење?\n🦊 Ово Notebook LM бочна трака Chrome проширење је напредни алат који покреће вештачка интелигенција дизајниран да помогне корисницима да организују, лако креирају нове пројекте и беспрекорно додају изворе и такође генеришу увиде са лакоћом. Било да радите на дубинском истраживању или вам је потребан асистент којег покреће вештачка интелигенција, ово је ултимативно решење.\n\n🛠️ Како га користити?\n1️⃣ Инсталирајте проширење из Google Chrome продавнице\n2️⃣ Кликните на икону овог проширења у десном углу картице прегледача\n3️⃣ Почните да додајете документе или креирате нову бележницу инстантно\n\n🔍 Истражите алтернативе\n🚀 Тражите алтернативу за Notebook LM? Истражите слична АИ Notebook решења са упоредивим функцијама, осигуравајући флексибилност и ефикасност.\n\n💻 Побољшајте своје истраживање са Google LM\n📡 Користите алате које покреће вештачка интелигенција за генерисање резимеа\n✨ Организујте своје белешке са Notebook Google KLM\n📃 Ефикасно сарађујте користећи LM Notes\n\n🌟 АИ notebook lm за паметније истраживање\n🏷️ Побољшајте продуктивност са NotebookLM Podcast алатима\n🖋️ Искористите notebook lm за структуриране увиде\n⚛️ Користите NotebookLM за академски и професионални рад\n\n🎧 АИ генератор подкаста и учење\n🗣️ Претворите дискусије у структуриране белешке\n💬 Научите како да генеришете подкасте вештачке интелигенције са google lm\n🔑 Брзо приступите кључним увидима користећи функције google lm\n\n💡 Google AI генератор подкаста\n💡 Аутоматизујте транскрипцију и сумирање подкаста\n⏳ Уштедите време са текстом који генерише вештачка интелигенција из дискусија\n📀 Побољшајте учење и истраживање са увидима које покреће АИ\n\n🧠 АИ револуција\n🚀 Google ai notebook трансформише начин на који интерагујете са информацијама онлајн. Ово NoteboolLLM решење пружа интелигентну помоћ за:\n➤ Сумирање комплексних тема\n➤ Идентификовање кључних концепата\n➤ Генерисање увида из више извора\n➤ Креирање веза између различитих делова информација\n➤ Производњу свеобухватних извештаја и анализа\n\n💪 Повећајте продуктивност са Google AI\n📅 Останите организовани са интуитивним NotebookLM функцијама\n💰 Добијте тренутне увиде из NotebookLM\n🎚️ Поједноставите истраживање са напредним notebook ai\n\n🔄 Управљање изворима учињено једноставним\nПитате се колико извора може да рукује или како да преузмете изворе из проширења?\nПроширење нуди робусно управљање документима:\n➤ Додајте неограничене документе у своје пројекте\n➤ Организујте изворе по теми, пројекту или прилагођеним категоријама\n➤ Лако преузмите и извезите изворне материјале\n➤ Аутоматски пратите порекло докумената\n➤ Правилно цитирајте изворе са уграђеним алатима за цитирање\n\n💰 Велика вредност на сваком нивоу\nБрине вас цена? Будите сигурни да проширење нуди огромну вредност:\n➤ Бесплатни ниво са основним функцијама\n➤ Приступачне премиум опције за напредне кориснике\n➤ Пословна решења за тимове и организације\n➤ Посебне цене за образовне институције\n➤ Флексибилне опције плаћања које одговарају сваком буџету\n\n📱 Компатибилност са различитим платформама\nGoogle AI апликација ради на свим вашим уређајима:\n➤ Chrome прегледач на десктоп и лаптоп рачунарима\n➤ Мобилни прегледачи за приступ у покрету\n➤ Компатибилност са таблетима за флексибилну употребу\n➤ Доследно искуство на свим платформама\n➤ Аутоматска синхронизација између уређаја\n\n❓ Често постављана питања\n\n🌐 Могу ли га користити офлајн?\n📢 Тренутно, захтева интернет конекцију. Међутим, корисници могу сачувати садржај за офлајн приступ у свом прегледачу.\n\n📝 Колико извора notebooklm?\n✈️ Google lm омогућава корисницима да додају више извора без ограничења\n⛄ Идеално за дубинско истраживање, креирање садржаја и организацију знања\n\n💾 Како преузети изворе из notebook lm?\n🌊 Приступите својим изворима на google lm сајту\n🦊 Користите уграђену функцију извоза за преузимање извора\n🐶 Ефикасно организујте и чувајте своје податке\n\n📌 Може ли ai notebook да генерише садржај на основу мојих извора?\n💡 Да! АИ може да креира резимее, извештаје, па чак и креативни садржај на основу ваших прикупљених извора.\n\n📌 Могу ли користити Notebook LM за академско истраживање?\n💡 Апсолутно! Проширење је савршено за академско истраживање са правилним могућностима цитирања и праћења извора.\n\n📌 Да ли Notebook LM подржава више језика?\n💡 Да, проширење подржава десетине језика за заиста глобалне могућности истраживања.\n\n📌 Да ли су моји подаци безбедни са NotebookML?\n💡 Да! Ваши подаци су заштићени индустријским стандардом енкрипције и робусним Google безбедносним праксама.\n\n🚀 Инсталирајте Chrome проширење сада и подигните своје искуство истраживања на следећи ниво са Notebook LM!"
   }
}
